const fs = require('fs');
const path = require('path');
const express = require('express');
const expressHbs = require('express-handlebars');
const {getAllUsers, addUserForEmail, login, getUserById} = require('./allFunctions');

const app = express();
// Вам потрібно реалізувати мінімум 5 строрінок.
// 1) Реєстрація
// 2) Логінація.
// 3) Список всіх юзерів.
// 4) Інформація про одного юзера
// 5) Помилка
//
// При реєстрації юзер вводть мейл, нік та пороль і ви його данні дописуєте в файл.
// Але тільки якщо його немає ще. Якшо він є, то видаєте помилку.
// Після реєстрації переходите на сторінку зі всіма юзерми.
//
//При логінації юзер так само ввоить мейл та пароль і вам необхідно знайти його мейлик в списку юзерів та якщо такий мейлик з таким паролем є,
//то віддати інформацію про юзера. В інакшому випадку сказати, що необхідно реєструватись.
//
//При реєстрації мейли не можуть повторюватись
app.listen(5000, () => {
    console.log(`server is work`);
});

app.get('/', ((req, res) => {

}));

app.post('/', ((req, res) => {

}));

app.get('/users', ((req, res) => {

}));

app.get('/users/:id', ((req, res) => {

}));

app.get('/error', ((req, res) => {

}));